import string


# ==================================================================================================================================
# |                                                   UTILS FOR PRICES ANALYTICS                                                   |
# ==================================================================================================================================


def safe_filename(filename: str) -> str:
    """
    Преобразует строку в безопасное название файла,
    удаляя недопустимые символы и обеспечивая наличие только одного пробела между словами.
    """

    valid_chars = "-_.() %s%s" % (string.ascii_letters, string.digits)
    filename = "".join(
        c for c in filename if c in valid_chars
    )  # Очищаем строку от недопустимых символов

    words = filename.split()  # Разбиваем строку на слова
    safe_filename = " ".join(words)  # Объединяем слова с помощью одного пробела

    return safe_filename


# ==================================================================================================================================

if __name__ == "__main__":
    filename = "Soldier | Phoenix.csv"
    safe_filename = safe_filename(filename)
    print(safe_filename)
